000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/КлючевыеАтрибутыЗапросовДоступности/КлючевыеАтрибутыЗапросовДоступности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КлючевыеАтрибутыЗапросовДоступности</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СтатусЗапроса</name>
    <type>
      <types>EnumRef.СтатусыЗапросовДоступностиТоваровШапка</types>
    </type>
  </resources>
  <resources>
    <name>ОтправкаПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОправленоВNavision</name>
    <type>
      <types>EnumRef.СтатусыЗапросаДоступностиВNavision</types>
    </type>
  </resources>
  <resources>
    <name>ХешЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ЗапросДоступности</name>
    <type>
      <types>DocumentRef.ЗапросДоступностиТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Enums/СтатусыЗапросовДоступностиТоваровШапка/СтатусыЗапросовДоступностиТоваровШапка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗапросовДоступностиТоваровШапка</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>Удалён</name>
  </enumValues>
  <enumValues>
    <name>КОтправке</name>
  </enumValues>
  <enumValues>
    <name>Отменён</name>
  </enumValues>
  <enumValues>
    <name>Изменён</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>Сборка</name>
  </enumValues>
  <enumValues>
    <name>ПродажаНаКассе</name>
  </enumValues>
  <enumValues>
    <name>ПродажаБезнал</name>
  </enumValues>
  <enumValues>
    <name>ЧастичноСогласован</name>
  </enumValues>
  <enumValues>
    <name>Отправлен</name>
  </enumValues>
  <enumValues>
    <name>Получен</name>
  </enumValues>
  <enumValues>
    <name>ПодтвердитьОтмену</name>
  </enumValues>
  <enumValues>
    <name>Выдан</name>
  </enumValues>
  <enumValues>
    <name>ЧекВКЦ</name>
  </enumValues>
  <enumValues>
    <name>ВыданДоставке</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/КлючевыеАтрибутыЗапросовДоступности/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Запись ключевых атребутов запроса доступности.
// 
// Параметры:
//  СтруктураЗаписи - Структура - Структура для изменения регистра:
//		* ЗапросДоступности - ДокументСсылка.ЗапросДоступностиТоваров
//		* СтатусЗапроса - ПеречислениеСсылка.СтатусыЗапросовДоступностиТоваровШапка
//		* ОтправкаПочты - Булево 
//		* ОправленоВNavision - ПеречислениеСсылка.СтатусыЗапросаДоступностиВNavision
Процедура ЗаписьКлючевыхАтребутовЗапросаДоступности(СтруктураЗаписи) Экспорт

	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.ОбменДанными.Загрузка = Истина;
	НаборЗаписей.Отбор.Период.Установить(ТекущаяДатаСеанса());
	НаборЗаписей.Отбор.ЗапросДоступности.Установить(СтруктураЗаписи.ЗапросДоступности);

	ЗаписьНабора = НаборЗаписей.Добавить();

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ТаблицаРегистра.Период КАК Период,
		|	ТаблицаРегистра.ЗапросДоступности КАК ЗапросДоступности,
		|	ТаблицаРегистра.СтатусЗапроса КАК СтатусЗапроса,
		|	ТаблицаРегистра.ОтправкаПочты КАК ОтправкаПочты,
		|	ТаблицаРегистра.ДатаИзменения КАК ДатаИзменения,
		|	ТаблицаРегистра.Примечание КАК Примечание,
		|	ТаблицаРегистра.ОправленоВNavision КАК ОправленоВNavision
		|ИЗ
		|	РегистрСведений.КлючевыеАтрибутыЗапросовДоступности.СрезПоследних(, ЗапросДоступности = &ЗапросДоступности) КАК
		|		ТаблицаРегистра";
	
	Запрос.УстановитьПараметр("ЗапросДоступности", СтруктураЗаписи.ЗапросДоступности);
	
	ТЗАтрибутов = Запрос.Выполнить().Выгрузить();
	
	Если ТЗАтрибутов.Количество() = 0 Тогда
		СтрокаАтрибутов = ТЗАтрибутов.Добавить();
		СтрокаАтрибутов.ЗапросДоступности = СтруктураЗаписи.ЗапросДоступности;
	Иначе
		СтрокаАтрибутов = ТЗАтрибутов[0];
	КонецЕсли;
	
	ЗаписатьРегистр = Ложь;

	Для Каждого КлючЗначение Из СтруктураЗаписи Цикл

		Если КлючЗначение.Значение = СтрокаАтрибутов[КлючЗначение.Ключ]
				Или КлючЗначение.Значение = Неопределено Тогда

			Продолжить;
			
		Иначе
			
			СтрокаАтрибутов[КлючЗначение.Ключ] = КлючЗначение.Значение;
			ЗаписатьРегистр = Истина;

		КонецЕсли;
	
	КонецЦикла;
	
	Если ЗаписатьРегистр Тогда
		
		ЗаполнитьЗначенияСвойств(ЗаписьНабора, СтрокаАтрибутов);
		ЗаписьНабора.Период			 = НаборЗаписей.Отбор.Период.Значение;
		ЗаписьНабора.ЗапросДоступности = НаборЗаписей.Отбор.ЗапросДоступности.Значение;
		ЗаписьНабора.ДатаИзменения = ТекущаяДатаСеанса();

		НаборЗаписей.Записать();
		
	КонецЕсли;

КонецПроцедуры

// Инициализация структуры записи регистра.
// 
// Параметры:
//  ЗД - ДокументСсылка.ЗапросДоступностиТоваров
// 
// Возвращаемое значение:
// 	Структура - структура регистр для записи:
//		* ЗапросДоступности - ДокументСсылка.ЗапросДоступностиТоваров
//		* СтатусЗапроса - ПеречислениеСсылка.СтатусыЗапросовДоступностиТоваровШапка
//		* ОтправкаПочты - Булево 
//		* ОправленоВNavision - ПеречислениеСсылка.СтатусыЗапросаДоступностиВNavision
//  
Функция ИнициализацияСтруктурыЗаписиРегистра(ЗД) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ЗапросДоступности",		ЗД);
	Результат.Вставить("СтатусЗапроса",			Перечисления.СтатусыЗапросовДоступностиТоваровШапка.ПустаяСсылка());
	Результат.Вставить("ОтправкаПочты",			Ложь);
	Результат.Вставить("ОправленоВNavision",	Перечисления.СтатусыЗапросаДоступностиВNavision.ПустаяСсылка());

	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти
	
#КонецЕсли
